# Seleccionar datos de Frameworks con pandas y numpy

In [30]:
import pandas as pd
import numpy as np

In [31]:
lista_valores = np.arange(25).reshape(5,5)
lista_valores

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [32]:
lista_indice = ['i1', 'i2', 'i3', 'i4', 'i5']
lista_indice

['i1', 'i2', 'i3', 'i4', 'i5']

In [33]:
lista_columnas = ['c1', 'c2', 'c3', 'c4', 'c5']
lista_columnas

['c1', 'c2', 'c3', 'c4', 'c5']

In [34]:
dataframe = pd.DataFrame(lista_valores, index=lista_indice, columns=lista_columnas)
dataframe

    c1  c2  c3  c4  c5
i1   0   1   2   3   4
i2   5   6   7   8   9
i3  10  11  12  13  14
i4  15  16  17  18  19
i5  20  21  22  23  24

# Para acceder a las columnas usamos:

In [36]:
dataframe['c2']

i1     1
i2     6
i3    11
i4    16
i5    21
Name: c2, dtype: int64

# Para acceder a un dato en especifico podemos nombrar la COLUMNAy luego la FILA

In [39]:
dataframe['c3']['i5']

22

# Si se quiere seleccionar 2 columnas usamos

In [41]:
dataframe[['c2','c4']]

    c2  c4
i1   1   3
i2   6   8
i3  11  13
i4  16  18
i5  21  23

# Tambien la podemos seleccionar por rangos ejmplo de c2 a c5

In [52]:
dataframe[dataframe['c2'] > 15]

    c1  c2  c3  c4  c5
i4  15  16  17  18  19
i5  20  21  22  23  24

In [53]:
df = dataframe
df

    c1  c2  c3  c4  c5
i1   0   1   2   3   4
i2   5   6   7   8   9
i3  10  11  12  13  14
i4  15  16  17  18  19
i5  20  21  22  23  24

In [57]:
df > 20

       c1     c2     c3     c4     c5
i1  False  False  False  False  False
i2  False  False  False  False  False
i3  False  False  False  False  False
i4  False  False  False  False  False
i5  False   True   True   True   True

In [60]:
df

    c1  c2  c3  c4  c5
i1   0   1   2   3   4
i2   5   6   7   8   9
i3  10  11  12  13  14
i4  15  16  17  18  19
i5  20  21  22  23  24

# Para mostrar toda una fila usamos .loc['indice']

In [61]:
df.loc['i3']

c1    10
c2    11
c3    12
c4    13
c5    14
Name: i3, dtype: int64

# de la misma manera si queremos seleccionar un dato unico podemos usar .loc

In [62]:
df.loc['i3']['c4']

13

# Operaciones sobre Series y Dataframes